model {
  ssd {
    num_classes: 3
    image_resizer {
      fixed_shape_resizer {
        height: 300
        width: 300
      }
    }
    feature_extractor {
      type: "ssd_mobilenet_v2"

    }
    anchor_generator {
      ssd_anchor_generator {
        num_layers: 6
        min_scale: 0.04
        max_scale: 0.4
        aspect_ratios: 0.5
        aspect_ratios: 0.46
        aspect_ratios: 0.43
        aspect_ratios: 0.4
        aspect_ratios: 0.37
      }
    }
  }
train_config {
  batch_size: 5
  optimizer {
    rms_prop_optimizer {
      learning_rate {
        exponential_decay_learning_rate {
          initial_learning_rate: 0.005
          decay_steps: 40000
          decay_factor: 0.95
        }
      }
      momentum_optimizer_value: 0.899999976158
      decay: 0.899999976158
      epsilon: 1.0
    }
  }
  fine_tune_checkpoint: "/content/models/research/pretrained_model/model.ckpt"
  num_steps: 40000
  fine_tune_checkpoint_type: "detection"
}
train_input_reader {
  label_map_path: "annotations/label_map.pbtxt"
  tf_record_input_reader {
    input_path: "annotations/train.record"
  }
}
eval_config {
  num_examples: 50
  metrics_set: "coco_detection_metrics"
  use_moving_averages: false
}
eval_input_reader {
  label_map_path: "annotations/label_map.pbtxt"
  shuffle: false
  num_readers: 1
  tf_record_input_reader {
    input_path: "annotations/test.record"
  }
}